data = {
  AAAA: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:乾卦䷀", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大有卦䷍", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷀ 乾，元亨利貞。 
        《象》曰：天行健：君子以自強不息。 
        全卦以「龍」為意象，剛健為德性：以變化、彈性為吉應，「過高」、「剛強好勝」。頑固或堅持己見為大忌。`,
  },
  2073: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  2072: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  2071: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  2070: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  2069: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  2068: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  2067: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  2066: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  2065: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  2064: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  2063: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  2062: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  2061: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  2060: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  2059: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  2058: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  2057: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  2056: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  2055: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  2054: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  2053: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  2052: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  2051: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  2050: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  2049: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  2048: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  2047: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  2046: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  2045: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  2044: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  2043: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  2042: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  2041: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  2040: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  2039: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  2038: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  2037: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  2036: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  2035: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  2034: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  2033: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  2032: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  2031: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  2030: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  2029: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  2028: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  2027: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  2026: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  2025: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  BBBB: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:離卦䷝", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豐卦䷶", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷝ 離，利貞，亨，畜牝牛吉。
        《象》曰：明兩作，離，大人以繼明照于四方。
        離為「麗」、「附麗」，的意思。在自然現象中離代表的是火，火本身並無法獨立存在，必需依附於物體上，因此取其「附麗」，意思為「附著在他物上的美麗」。在三畫卦 （八卦）中，離則是一陰包於二陽之內，其卦象意思為陰「附麗」於陽。`,
  },
  2024: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  2023: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  2022: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  2021: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  2020: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  2019: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  2018: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  2017: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  2016: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  2015: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  2014: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  2013: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  2012: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  2011: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  2010: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  2009: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  2008: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  2007: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  2006: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  2005: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  2004: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  2003: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  2002: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  2001: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  2000: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1999: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1998: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1997: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1996: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1995: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  CCCC: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:坎卦䷜", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:困卦䷮", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷜ 習坎，有孚，維心亨，行有尚。
        《象》曰：水洊至，習坎。君子以常德行，習教事。
        前後都有危險，習慣於危險。坎卦意思的由來，取三畫卦 （八卦）中，其陽爻坎陷，被兩陰所包圍而沒有出路。坎為水，也是危險之意。`,
  },
  1994: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1993: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1992: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1991: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1990: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1989: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1988: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1987: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1986: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1985: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1984: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  DDDD: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:坤卦䷁", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:比卦䷇", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷁ 坤，元亨，利牝馬之貞。君子有攸往。先迷後得，主利，西南得朋，東北喪朋，安貞吉。
        《象》曰：地勢坤，君子以厚德載物。
        坤為純陰之卦，六爻皆陰。代表的是大地、母親，以及柔順、包容，與慈愛等德性，吉位在西南，十月之卦。`,
  },
  1983: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1982: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1981: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1980: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1979: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1978: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1977: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1976: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1975: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1974: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1973: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1972: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1971: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1970: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1969: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1968: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1967: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1966: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1965: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1964: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1963: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1962: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1961: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1960: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1959: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1958: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1957: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1956: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1955: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1954: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1953: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1952: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1951: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1950: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1949: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1948: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1947: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1946: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1945: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1944: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1943: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1942: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1941: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1940: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1939: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1938: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1937: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1936: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1935: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1934: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1933: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1932: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1931: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1930: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1929: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1928: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1927: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1926: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1925: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1924: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1923: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1922: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1921: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1920: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1919: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1918: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1917: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1916: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1915: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1914: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1913: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1912: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1911: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1910: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1909: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1908: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1907: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1906: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1905: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1904: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1903: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1902: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1901: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1900: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1899: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1898: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1897: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1896: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1895: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1894: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1893: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1892: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1891: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1890: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1889: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1888: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1887: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1886: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1885: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1884: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1883: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1882: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1881: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1880: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1879: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1878: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1877: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1876: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1875: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1874: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1873: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1872: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1871: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1870: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1869: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1868: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1867: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1866: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1865: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1864: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1863: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1862: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1861: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1860: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1859: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1858: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1857: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1856: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1855: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1854: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1853: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1852: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1851: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1850: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1849: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1848: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1847: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1846: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1845: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1844: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1843: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1842: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1841: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1840: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1839: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1838: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1837: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1836: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1835: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1834: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1833: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1832: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1831: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1830: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1829: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1828: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1827: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1826: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1825: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1824: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1823: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1822: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1821: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1820: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1819: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1818: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1817: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1816: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1815: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1814: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1813: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1812: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1811: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1810: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1809: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1808: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1807: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1806: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1805: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1804: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1803: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1802: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1801: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1800: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1799: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1798: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1797: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1796: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1795: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1794: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1793: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1792: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1791: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1790: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1789: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1788: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1787: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1786: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1785: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1784: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1783: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1782: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1781: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1780: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1779: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1778: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1777: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1776: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1775: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1774: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1773: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1772: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1771: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1770: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1769: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1768: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1767: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1766: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1765: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1764: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1763: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1762: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1761: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1760: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1759: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1758: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1757: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1756: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1755: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1754: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1753: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1752: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1751: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1750: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1749: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1748: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1747: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1746: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1745: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1744: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1743: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1742: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1741: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1740: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1739: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1738: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1737: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1736: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1735: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1734: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1733: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1732: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1731: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1730: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1729: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1728: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1727: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1726: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1725: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1724: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1723: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1722: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1721: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1720: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1719: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1718: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1717: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1716: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1715: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1714: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1713: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1712: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1711: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1710: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1709: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1708: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1707: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1706: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1705: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1704: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1703: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1702: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1701: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1700: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1699: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1698: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1697: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1696: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1695: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1694: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1693: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1692: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1691: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1690: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1689: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1688: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1687: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1686: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1685: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1684: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1683: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1682: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1681: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1680: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1679: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1678: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1677: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1676: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1675: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1674: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1673: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1672: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1671: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1670: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1669: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1668: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1667: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1666: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1665: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1664: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1663: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1662: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1661: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1660: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1659: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1658: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1657: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1656: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1655: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1654: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1653: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1652: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1651: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1650: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1649: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1648: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1647: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1646: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1645: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1644: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1643: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1642: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1641: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1640: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1639: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1638: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1637: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1636: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1635: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1634: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1633: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1632: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1631: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1630: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1629: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1628: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1627: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1626: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1625: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1624: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1623: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1622: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1621: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1620: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1619: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1618: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1617: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1616: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1615: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1614: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1613: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1612: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1611: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1610: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1609: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1608: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1607: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1606: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1605: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1604: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1603: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1602: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1601: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1600: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1599: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1598: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1597: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1596: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1595: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1594: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1593: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1592: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1591: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1590: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1589: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1588: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1587: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1586: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1585: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1584: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1583: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1582: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1581: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1580: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1579: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1578: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1577: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1576: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1575: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1574: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1573: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1572: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1571: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1570: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1569: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1568: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1567: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1566: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1565: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1564: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1563: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1562: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1561: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1560: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1559: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1558: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1557: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1556: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1555: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1554: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1553: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1552: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1551: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1550: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1549: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1548: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1547: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1546: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1545: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1544: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1543: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1542: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1541: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1540: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1539: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1538: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1537: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1536: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1535: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1534: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1533: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1532: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1531: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1530: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1529: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1528: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1527: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1526: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1525: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1524: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1523: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1522: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1521: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1520: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1519: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1518: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1517: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1516: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1515: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1514: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1513: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1512: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1511: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1510: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1509: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1508: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1507: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1506: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1505: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1504: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1503: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1502: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1501: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1500: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1499: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1498: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1497: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1496: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1495: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1494: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1493: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1492: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1491: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1490: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1489: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1488: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1487: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1486: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1485: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1484: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1483: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1482: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1481: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1480: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1479: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1478: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1477: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1476: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1475: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1474: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1473: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1472: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1471: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1470: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1469: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1468: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1467: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1466: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1465: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1464: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1463: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1462: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1461: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1460: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1459: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1458: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1457: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1456: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1455: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1454: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1453: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1452: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1451: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1450: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1449: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1448: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1447: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1446: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1445: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1444: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1443: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1442: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1441: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1440: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1439: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1438: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1437: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1436: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1435: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1434: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1433: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1432: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1431: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1430: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1429: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1428: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1427: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1426: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1425: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1424: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1423: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1422: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1421: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1420: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1419: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1418: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1417: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1416: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1415: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1414: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1413: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1412: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1411: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1410: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1409: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1408: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1407: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1406: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1405: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1404: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1403: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1402: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1401: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1400: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1399: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1398: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1397: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1396: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1395: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1394: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1393: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1392: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1391: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1390: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1389: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1388: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1387: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1386: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1385: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1384: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1383: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1382: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1381: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1380: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1379: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1378: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1377: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1376: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1375: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1374: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1373: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1372: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1371: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1370: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1369: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1368: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1367: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1366: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1365: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1364: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1363: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1362: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1361: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1360: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1359: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1358: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1357: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1356: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1355: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1354: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1353: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1352: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1351: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1350: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1349: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1348: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1347: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1346: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1345: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1344: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1343: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1342: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1341: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1340: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1339: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1338: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1337: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1336: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1335: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1334: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1333: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1332: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1331: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1330: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1329: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1328: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1327: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1326: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1325: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1324: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1323: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1322: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1321: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1320: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1319: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1318: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1317: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1316: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1315: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1314: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1313: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1312: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1311: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1310: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1309: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1308: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1307: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1306: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1305: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1304: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1303: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1302: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1301: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1300: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1299: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1298: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1297: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1296: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1295: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1294: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1293: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1292: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1291: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1290: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1289: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1288: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1287: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1286: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1285: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1284: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1283: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1282: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1281: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1280: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1279: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1278: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1277: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1276: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1275: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1274: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1273: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1272: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1271: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1270: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1269: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1268: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1267: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1266: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1265: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1264: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1263: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1262: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1261: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1260: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1259: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1258: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1257: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1256: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1255: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1254: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1253: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1252: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1251: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1250: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1249: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1248: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1247: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1246: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1245: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1244: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1243: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1242: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1241: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1240: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1239: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1238: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1237: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1236: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1235: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1234: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1233: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1232: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1231: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1230: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1229: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1228: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1227: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1226: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1225: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1224: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1223: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1222: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1221: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1220: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1219: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1218: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1217: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1216: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1215: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1214: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1213: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1212: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1211: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1210: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1209: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1208: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1207: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1206: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1205: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1204: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1203: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1202: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1201: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1200: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1199: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1198: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1197: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1196: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1195: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1194: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1193: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1192: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1191: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1190: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1189: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1188: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1187: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1186: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1185: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1184: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1183: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1182: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1181: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1180: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1179: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1178: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1177: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1176: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1175: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1174: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1173: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1172: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1171: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1170: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1169: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1168: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1167: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1166: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1165: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1164: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1163: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1162: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1161: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1160: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1159: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1158: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1157: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1156: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1155: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1154: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1153: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1152: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1151: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1150: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1149: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1148: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1147: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1146: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1145: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1144: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1143: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1142: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1141: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1140: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1139: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1138: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1137: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1136: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1135: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1134: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1133: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
  1132: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:睽卦䷥", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:家人卦䷤", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷥ 暌，小事吉
        《象》曰：上火下澤，睽，君子以同而異。
        暌卦的意思為乖離，人與人相互見外，彼此涇渭分明。同牀異夢、各走各的路、道不同不相為謀，都可以用來說明睽卦。`,
  },
  1131: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:益卦䷩", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷵ 歸妹，征凶，无攸利。
        《象》日：澤上有雷，歸妹。君子以永終知敝。
        歸妹為嫁女兒的意思。古時女子嫁人曰歸，妹則是指少女，年青的女子。與歸妹成一對卦的漸卦也說「女歸吉」，但兩卦的意思稍有不同。漸卦為男方娶女方，所以說「女歸」，女子歸之：歸妹則是女方將女子嫁出去。另一個重要差別則是：漸卦是循序漸進，符合禮法與傳統；歸妹則是女子動情馬上就嫁人，不符合傳統的禮法。`,
  },
  1130: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:中孚卦䷼", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:巽卦䷸", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷼ 中孚，豚魚吉，利涉大川，利貞。
        《象》曰：澤上有風，中孚，君子以議獄緩死。
        孚為信，誠信、可靠的意思。中孚則有兩重的意義。一是忠孚，忠為誠，孚為信，中孚即誠信；二是表孚，意謂誠信發乎内心。`,
  },
  1129: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:節卦䷻", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "0", "(癸)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:渙卦䷺", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷻ 節，亨。苦節，不可貞。
        《象》曰：澤上有水，節。君子以制數度，議德行。
        卦象上坎水，下兌澤。澤是儲存水的地方，澤上有水，則有溢滿的危險，所以當調節、節制，為適可而止之象。又内兌悅，外坎險，喜悅以行險，吃苦當吃補，是處節的亨通之道。`,
  },
  1128: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(丁)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:損卦䷨", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:漸卦䷴", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷨ 損，有孚，元吉，无咎可貞，利有攸往，曷之用，二簋可用享。
        《象》曰：山下有澤，損，君子以懲忿窒欲。
        損就是去除，剝除，減損的意思，但要去除什麼？於修身則是去除多餘的慾堂望，壞習性；於處世則是犧牲自己的利益，成全大我的成就。`,
  },
  1127: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:臨卦䷒", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:觀卦䷓", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭:䷒ 臨，元亨利貞，至于八月有凶。
        《象》曰：澤上有地，臨。君子以教思无窮，容保民无疆。
        臨近丶監督視察。
        君子、大人的氣勢在高漲，上位者親身下去督察下屬，探訪民情。八月會有災禍。`,
  },
  1126: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:同人卦䷌", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大壯卦䷡", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷌ 同人于野，导，利涉大川，利君子貞。
        《象》曰：天與火，同人。君子以類族辨物。
        卦象為内文明（離明）而外剛健（乾健），代表卜到這卦的人本質聰明而能剛健行事，能和別人打成一片。`,
  },
  1125: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:革卦䷰", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:歸妹卦䷵", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷰ 革，已日乃孚，元亨利貞，悔亡。
        《象》曰：澤中有火，革，君子以治曆明時。
        改革、變革、革命、去除舊的。革的原意為皮革，也就是除毛之後的獸皮，引伸為去舊。`,
  },
  1124: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豐卦䷶", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:震卦䷲", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷶ 豐亨，王假之，勿憂，宜日中。
        《象》曰：雷電皆至，豐，君子以折獄致刑。
        《說文》：「豐，豆之豐滿者也。从豆，象形。」「豆」為古時盛肉的器具，豆器装得滿滿的就是豐，引伸就是豐富、盛大的意思。`,
  },
  1123: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:家人卦䷤", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:恒卦䷟", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷤ 家人，利女貞。
        《象》日：風自火出，家人，巷于以言有物，而行有恒。
        家人卦是「家中之人」的意思，講的是「齊家」之道一一女人賢慧，治家有道，則男人可以安心而努力的在外奮鬥打拼，所以自古儒家就有「齊家、治國、平天下」的名言，《彖傳》則說：「家人，女正位乎內，男正位乎外，男女正，大地之大義也。」`,
  },
  1122: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:解卦䷧", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷾ 既濟，亨小，利貞，初吉終亂。
        《象》曰：水在火上，既濟，君子以思患而豫防之。
        這一卦之所以會叫做既濟，是因為它符合易經中一切當位、相應的原理，就《易經》的原理上來說是「最完美」的一個模範卦。`,
  },
  1121: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:賁卦䷕", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小過卦䷽", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷕賁，亨小，利有攸往。
        《象》曰：山下有火，賁。巷子以明庶政，无敢折獄。
        賁卦卦象內為離明，外為艮止。内離明為君子能藏其聰明、美麗於内，外艮止則是行為停止於外，也就是有所不為，所以彖傳說：「文明以止，人文也。」`,
  },
  1120: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:明夷卦䷣", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:豫卦䷏", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷣ 明夷，利艱貞。
        《象》曰：明入地中，明夷。君子以莅眾，用晦而明。
        明夷的定義為「光明受到剷除」，明指光明，也可象徵人才、君子、賢人、好人，人的聰明智慧。
        夷為剷除的意思，《雜卦傳》：「明夷，誅也。」`,
  },
  1119: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:無妄卦䷘", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "0", "(丁)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷘无妄，元亨利貞。其匪正有眚，不利有攸往。
        《象》曰：天下雷行，物與无妄。先王以茂對，時育萬物。
        无妄有兩層意思，一是就做事的態度來說，「没有虛妄」、「不亂來」（妄作「虚
        妄」、「亂」），意調凡事依照道理而無一絲苟且隨便。二是就修養的心境來說，「沒有期望」，意思為内心放空，不期望於世俗的成就與名利，超然於物外。`,
  },
  1118: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:隨卦䷐", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:損卦䷨", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷐ 隨，元亨利貞，无咎。
        《象》曰：澤中有雷，隨。君子以嚮晦入宴息。
        隨卦卦象為內震動而外澤兌，動而悅，行動而喜悅，随緣、順其自然之象。`,
  },
  1117: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:賁卦䷕", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷔ 噬嗑亨，利用獄。
        《象》曰：雷電，噬嗑，先王以明罰敕法。
        「噬嗑」音同 「適合」。咬合、磨合，口中咬物的意思：也有懲奸除惡之意。`,
  },
  1116: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:震卦䷦", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:頤卦䷚", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷲ 震亨，震來虩虩，笑言啞啞，震驚百里，不喪匕鬯。
        《象》曰：洊雷震，君子以恐懼脩省。
        震卦上下都是震，卦義直接從三畫卦的震卦而來，為變動、震動、震驚，驚動之意，引伸有當頭棒喝的意思。`,
  },
  1115: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛 )", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:益卦䷩", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(己)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(丁)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷩ 益，利有攸往，利涉大川。
        《象》曰：風雷，益，君子以見善則遷，有過則改。
        積極進取，努力上進。「努力」的成果總要等待時間的累積，因此就吉凶的判斷上，益卦和損卦一樣，都比較屬於長遠性的利益，而不是立即性的，因此卦辭都有「利有攸往」。`,
  },
  1114: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:屯卦䷂", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蒙卦䷃", "互卦:復卦䷗"],
    hexagram_description: `
    ䷂ 屯，元亨利貞，勿用有攸往，利建侯。 
    《象》曰：雲雷屯，君子以經綸。 
    「屯」這個字是取小草剛從地面上冒出頭來，有點卷曲而未申展開來的樣子。屯的難處，在於物體剛出生而尚未茁壯，所以這是一種「凡事起頭難」的挑戰。`,
  },
  1113: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:頤卦䷚", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:艮卦䷳", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷚ 頤，貞吉，觀頤，自求口實。
        《象》曰：山下有雷，頤，君子以慎言語，節飲食。
        顾原意就是人的口頰，引伸為「養」的意思：或者說是頤養。`,
  },
  1112: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:復卦䷗", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(丁)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:剝卦䷖", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷗ 復，亨，出入无疾，朋來无咎，反復其道，七日來復，利有攸往。
        《象》曰：雷在地中，復，先王以至日閉關，商旅不行，后不省方。
        「復」原意是「歸來」，「回家」的意思，引申則是指人改過遷善，而在 《易經》中更專指陽氣的歸來。`,
  },
  1111: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:剝卦䷖", "互卦:坤卦䷁"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷖剝，不利有攸往。
        《象》曰：山附于地，剝。上以厚下安宅。
        剝為東西爛掉而剝落、剝除的意思，所以 《雜卦傳》說：「剝，爛也。」`,
  },
  1110: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:比卦䷇", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坎卦䷜", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷇ 比，吉，原筮元永貞，无咎，不寧方來，後夫凶。
        《象》曰：地上有水，比。先王以建萬國，親諸侯。
        比卦卦象為五個陰爻向一個陽爻親近、比附，有眾臣親近、輔佐君王之象，因此得到「比」的卦義。`,
  },
  1109: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:觀卦䷓", "互卦:剝卦䷖"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:井卦䷯", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷓ 觀，盥而不薦，有孚顒若。
        《象》曰：風行地上，觀，先王以省方，觀民設教。
        觀卦上為風，下為地，風行地上，内順服而外漸進，風行草偃的卦象，表示君子以德感人，巽又有命令的意思，所以又有誥命天下之意。巽木在地上，則象徵命令、告不於天下，法律施行之象。`,
  },
  1108: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:豫卦䷏", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:屯卦䷂", "互卦:剝卦䷖"],
    hexagram_description: `
        卦辭: ䷏ 豫，利建侯、行師。
        《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。
        以柔順的心做事，依著事情的自然本性順勢而為，自然能讓事情融洽歡樂的完成。豫卦卦象為內坤順，外雷電，雷動於地上，柔順以動，則一切順其自然而易成。反觀大壯卦為剛健於內雷動於外，為剛以動，則產生衝撞與衝突。`,
  },
  1107: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:晉卦䷢", "互卦:蹇卦䷦"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:既濟卦䷾", "互卦:未濟卦䷿"],
    hexagram_description: `
        卦辭:䷢ 晉，康候用錫馬蕃庶，晝日三接。
        《象》曰：明出地上，晉。君子以自昭明德。
        上進、晉升。晉卦是「進升」的意思，有能力的人得以上進， 能夠出頭天。`,
  },
  1106: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:萃卦䷬", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:節卦䷻", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷬ 萃，亨，王假有廟。利見大人，亨，利貞，用大牲吉，利有攸往。
        《象》曰：澤上於地，萃，君子以除戎器，戒不虞。
        聚集、萬物薈萃，水澤滋潤大地。萃原本是草木生 長茂盛的樣子，《易經》的萃則作 「聚」解釋，取其萬物生長繁盛而群聚的意思。`,
  },
  1105: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:否卦䷋", "互卦:漸卦䷴"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(己)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(己)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:需卦䷄", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷋ 否之匪人，不利君子貞，大往小來。
        《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。
        「否」宇從「不」從「口」，代表人與人之間無法講話溝通，因此為溝通不良的意思。引申則是陰陽之氣無法交流，天地違和，生命没有出口，萬物凋零。`,
  },
  1104: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:謙卦䷎", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:否卦䷋", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭: ䷎ 謙，亨，君子有終。
        《象》曰：地中有山，謙，者子以裒多益寡，稱物平施。
        謙卦卦象為山崇高而居於地下，地勢低而上行，有因謙卑而崇高之意。山艮止於内而收斂不發，坤柔順在外以待人，為君子謙卑以自牧，柔順以處世之象。`,
  },
  1103: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:艮卦䷳", "互卦:解卦䷧"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:遯卦䷠", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷳ 艮其背，不獲其身；行其庭，不見其人。无咎。
        《象》曰：兼山艮，君子以思不出其位。
        艮為山，山阻擋在前，停止不前之意。重重的山擋住去路，去路不通，凡事停止無法前進。`,
  },
  1102: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蹇卦䷦", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:訟卦䷅", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷦ 蹇，利西南，不利東北，利見大人，貞吉。
        《象》曰：山上有水，蹇，君子以反身脩德。
        蹇卦的意思則是「難」，因為前面有危險而無法前進。《彖傳》說：「蹇，難也、險在前也。見險而能止，知矣哉。」卦象内艮止，外坎險，也就是見到危險而能夠停止，當止則止，這就是智慧。`,
  },
  1101: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:漸卦䷴", "互卦:未濟卦䷿"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:姤卦䷫", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷴ 漸，女歸吉，利貞。
        《象》曰：山上有木，漸，君子以居賢德善俗。
        漸卦卦象為内艮止，外巽入，止而漸入，按部就班、循序漸進之狀。山上有木，樹木生 長於山上，適得其所；少男下於長女，女子得其歸宿。`,
  },
  1100: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小過卦䷽", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:無妄卦䷘", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷽ 小過，亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宣下，大吉。
        《象》曰：山上有雷，小過。君子以行過乎恭，喪過乎哀，用過乎儉。
        小過指的是「陰氣過盛」，《易經》中大指的是陽，小指的則是陰。「大過」為陽氣過盛，小過卦則為陽氣不足，陰氣過盛。`,
  },
  1099: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:旅卦䷷", "互卦:大過卦䷛"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:同人卦䷌", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷷ 旅，小亨，旅貞吉。
        《象》曰：山上有火，旅，君子以明慎用刑而不留獄。
        旅原指軍隊編制 ，一旅為五百人，但在易經裡，旅卦意指人失去安居的地方，有流落他鄉之意。`,
  },
  1098: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:咸卦䷞", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:履卦䷉", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷞ 咸亨，利貞，取女吉。
        《象》曰：山上有澤，咸，君子以虛受人。
        感，感應，感動。咸音「賢」，為「感」的意思，也就是感應。`,
  },
  1097: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:遯卦䷠", "互卦:姤卦䷫"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(癸)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "0", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(己)", "甲 己", "0", "(癸)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:乾卦䷀", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷠遯亨，小利貞。
        《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。
        遯卦上乾健，下艮止，艮又為門闕。大畜卦（上艮止下乾健）是將人才納於門下，為養賢之象；遯則是相反，人才被隔之於門外，為賢人遠避以逃難之象。就卦氣來看，六
        月遯卦時陰氣開始增長，也是小人開始得勢，君子開始退避逃離以避難。`,
  },
  1096: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:師卦䷆", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:萃卦䷬", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷆ 師貞，丈人吉，无咎。
        《象》曰：地中有水，師，君子以容民畜眾。
        師是一人統領眾人，帶兵打仗的意思。卜到此卦表示事情複雜，責任重大，因此讓人憂心重重。`,
  },
  1095: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蒙卦䷃", "互卦:復卦䷗"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:咸卦䷞", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷃ 蒙，亨，匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告，利貞。 
        《象》曰：山下出泉，蒙。君子以果行育德。 
        蒙為「啟蒙」的蒙，繼「屯卦」而來，表示天地初開之後的蒙昧狀態，在人則比喻小孩尚未懂事的階段。 `,
  },
  1094: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:渙卦䷺", "互卦:頤卦䷚"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "0", "(己)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "0", "(己)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:大過卦䷛", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷺ 渙，亨，王假有廟，利涉大川，利貞。
        《象》曰：風行水上，渙，先王以享于帝，立廟。
        渙散、逃難，離散：化解危險。渙卦卦象下為坎水，上為巽木，是水上有木之象。`,
  },
  1093: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:解卦䷧", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:隨卦䷐", "互卦:漸卦䷴"],
    hexagram_description: `
        卦辭:䷧ 解，利西南，无所往，其來復吉。有攸往，夙吉。
        《象》曰：雷雨作，解。君子以赦過宥罪。
        解放、脫離危險，危難散去。解音 「姐」，解除的意思。或音「謝」，作卸除的意思。`,
  },
  1092: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:革卦䷰", "互卦:姤卦䷫"],
    hexagram_description: `
        卦辭:䷿ 未濟，亨。小狐汔濟，濡其尾，无攸利。
        《象》曰：火在水上，未濟，君子以慎辨物居方。
        未濟指的是水火無法相交，陰陽、冷熱無法調和。《易經》中以「小狐汔濟，濡其尾」來說明 ，小狐狸在旱季（汔）裡找水喝乞求救濟，看到了水坑，不知深淺就冒然跳下去，結果没喝到水還濕了尾巴，同時受到水火之害，此比喻水火無法調合。`,
  },
  1091: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:困卦䷮", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:兌卦䷹", "互卦:家人卦䷤"],
    hexagram_description: `
        卦辭:䷮ 困，亭，貞，大人吉，无咎，有言不信。
        《象》曰：澤无水，困。君子以致命遂志。
        困卦為窮困的意思，卦象上澤下水，水澤無法保留住水而讓水往下漏，為澤無水之象。反之，若水在澤上，則是水進澤中，那麼反而水澤是做為「調節」水源之用，就是節卦。`,
  },
  1090: {
    top_hexagram: [
      ["亥 丑", "0", "(丁)", "", "1", "(辛)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(辛)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:訟卦䷅", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:夬卦䷪", "互卦:乾卦䷀"],
    hexagram_description: `
        卦辭:䷅ 訟，有孚，窒惕，中吉，終凶，利見大人，不利涉大川。
        《象》曰；天與水違行，訟。君子以作事謀始。
        訟卦內水險而外剛健，象徵一個人的想法相當危險，而又倔強求勝；對於自己的危險想法堅持到底，一意孤行。因此而與人興訟、爭吵。`,
  },
  1089: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:升卦䷭", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:坤卦䷁", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷭ 升，元亨，用見大人，勿恤，南征吉。
        《象》曰：地中生木，升。君子以順德，積小以高大。
        升卦卦象是木在地下，木以土為生，土中之木將逐步成長為大樹，因此以「升」為卦名，取其逐漸成長的意義。`,
  },
  1088: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:蠱卦䷑", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:謙卦䷎", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷑ 蠱，元亨，利涉大川。先甲三目，後甲三日。
        《象》日：山下有風，蠱。者子以振民育德。
        「蠱」的字義是皿上有蟲，意思為東西腐壞。蟲又有蠱惑，惑亂的意思。`,
  },
  1087: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:井卦䷯", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:師卦䷆", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷯ 井，改邑不改井，无喪无得，往來井，井汔至，亦未繘井，羸其瓶，凶。
        《象》曰：木上有水，井，君子以勞民勸相。
        井卦卦象為木下於水，又裝水而出，也就是以木桶汲水之象。又上坎險下巽人， 漸進以通險，雖有險而能逐漸累積功夫，培養實力以渡過難關。`,
  },
  1086: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:巽卦䷸", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:升卦䷭", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷸ 巽，小亨，利有攸往，利見大人。
        《象》曰：隨風巽，君子以申命行事。
        巽是八純卦之一。巽在三畫卦中代表風、木、命令。於人倫上為長女，因為巽是一索而得女。巽卦的意思又有「浸入」，逐漸渗透、進入的意思，也有流行、風潮的意思。`,
  },
  1085: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:恒卦䷟", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:復卦䷗", "互卦:坤卦䷁"],
    hexagram_description: `
        卦辭:䷟ 恒亨，无咎，利貞，利有攸往。
        《象》曰：雷風，恒，君子以立不易方。
        恒卦上為震、為長男，下為巽、為長女。長男動於外，長女柔順於內，就像一個穩定而和譜的家庭，男主外、女主内，夫婦的内外分工很清楚，因此可以維持家庭的穩定和恒久。`,
  },
  1084: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:鼎卦䷱", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:明夷卦䷣", "互卦:解卦䷧"],
    hexagram_description: `
        卦辭:䷱ 鼎，元吉，亨。
        《象》曰：木上有火，鼎，君子以正位凝命。
        鼎卦是一個象形卦，其大象有如一個鼎的形狀，初六象徵鼎足，九二、九三及九四三個陽爻象徵鼎腹，六五象徵鼎耳，上九象徵舉鼎用的鼎鉉。就二體來看，卦象為木上有火，以薪柴燒火煮物，烹飪之象。`,
  },
  1083: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大過卦䷛", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:臨卦䷒", "互卦:復卦䷗"],
    hexagram_description: `
        卦辭:䷛ 大過，棟橈。利有攸往，亨。
        《象》曰：澤滅木，大過。君子以獨立不懼，遯世无悶。
        大過卦意思為「所過者大」，「大」指的是陽氣，「大過」就是「陽過」，意謂陽氣過盛。`,
  },
  1082: {
    top_hexagram: [
      ["亥 丑", "0", "(己)", "", "0", "(己)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(己)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:姤卦䷫", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "0", "(癸)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    hexagram_description: `
        卦辭:䷫ 姤，女壯，勿用取女。
        《象》曰：天下有風，姤，后以施命誥四方。
        姤卦意思為「遇到」，一陰返回而遇五陽，一女遇到五男，女子強悍而不貞，因此這種關係只能當作一時的邂遘，不用想天長地久。`,
  },
  1081: {
    top_hexagram: [
      ["亥 丑", "1", "(丁)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:夬卦䷪", "互卦:乾卦䷀"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:睽卦䷥", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷪ 夬，揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。
        《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。
        夬卦有兩個層面的意義，就大象來說，是五陽判決一陰，其次是就二體來說，澤上於天，澤以潤下，澤水滿溢而下，為水「決」而溢，君于有德而不居，有祿則施惠於下之象。`,
  },
  1080: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大有卦䷍", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:離卦䷝", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:大有卦 ䷍ 大有，元亨
        《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。
        卦象為「剛健而出明」（内卦為乾為健，外卦為離為明），上離下乾，火在天上，卦象為「日正當中」。
        此卦内剛健而外文明，内剛健者事情可以勝任，外文明者其人外表聰明，可以洞見真理。`,
  },
  1079: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(丁)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大壯卦䷡", "互卦:夬卦䷪"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(丁)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(丁)", "丁 壬", "1", "(辛)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "1", "(辛)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:噬嗑卦䷔", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷡ 大壯，利貞。
        《象》曰：雷在天上，大壯，君子以非禮弗履。
        大壯卦的卦義有三種不同的解釋，剛好也反應出大壯卦的三個不同面向：一是陽氣壯盛（陽壯），二是嚴重衝突（大撞），三是嚴重的傷害（大戕）。`,
  },
  1078: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:小畜卦䷈", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:鼎卦䷱", "互卦:夬卦䷪"],
    hexagram_description: `
        卦辭:䷈小畜，亨，密雲不雨，自我西郊。
        《象》曰：風行天上，小畜，君子以懿文德。
        小畜即「以小畜大」ーー 小人畜養君子，或女子畜養男子之意。`,
  },
  1077: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(癸)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:需卦䷄", "互卦:睽卦䷥"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(癸)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:未濟卦䷿", "互卦:既濟卦䷾"],
    hexagram_description: `
        卦辭:䷄ 需，有孚，光亨，貞吉，利涉大川。
        《象》曰：雲上於天，需，君子以飲食宴樂。
        需為「等待」的意思。需卦則是龍困淺灘的時候，宜於等待時機。二月之卦。`,
  },
  1076: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "1", "(辛)", "辰  寅"],
      ["申 戌", "1", "(癸)", "丙 辛", "1", "(辛)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(癸)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:大畜卦䷙", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "1", "(癸)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(癸)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:旅卦䷷", "互卦:大過卦䷛"],
    hexagram_description: `
        卦辭:䷙ 大畜，利貞，不家食，吉，利涉大川。
        《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。
        畜有三種解釋：一是「止」，二是「聚」，
        ，三是「養」。若與「小畜」合在一起看則更能了解「大畜」的意思。小畜是人才未受重用而坐吃山空於家裡，所止、所聚，所養都很小，所以稱「小畜」；而大畜則為人才食祿於外，因為所止、所聚、 所養都很大，所以叫「大畜」。`,
  },
  1075: {
    top_hexagram: [
      ["亥 丑", "1", "(癸)", "", "0", "(丁)", "寅 子"],
      ["戌 子", "0", "", "戊 癸", "1", "", "卯 丑"],
      ["酉 亥", "1", "(丁)", "丁 壬", "0", "(癸)", "辰  寅"],
      ["申 戌", "0", "(己)", "丙 辛", "1", "(癸)", "巳 卯"],
      ["未 酉", "0", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "0", "(己)", "甲 己", "0", "(己)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:泰卦䷊", "互卦:歸妹卦䷵"],
    bottom_hexagram: [
      ["巳 未", "0", "(己)", "", "0", "(己)", "申 午"],
      ["辰 午", "0", "", "戊 癸", "0", "", "酉 未"],
      ["卯 巳", "0", "(己)", "丁 壬", "1", "(丁)", "戌 申"],
      ["寅 辰", "1", "(辛)", "丙 辛", "0", "(丁)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "1", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(辛)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:晉卦䷢", "互卦:蹇卦䷦"],
    hexagram_description: `
        卦辭:䷊泰，小往大來，吉亨。
        《象》曰：天地交，泰。后以財成天地之道，輔相天地之宜，以左右民。
        泰卦卦象原本在下的「地氣」（坤）由下往上行，原本在上的「天氣」由上往下走，代表天地之氣互相交合而通泰。反之，地氣若停留在下、天氣停留在上，則為陰陽窒塞，沒有交流而成「否」卦。`,
  },
  1074: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "1", "(丁)", "辰  寅"],
      ["申 戌", "1", "(辛)", "丙 辛", "0", "(丁)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "1", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(辛)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:履卦䷉", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "1", "(辛)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:小畜卦䷈", "互卦:睽卦䷥"],
    hexagram_description: `
        卦辭:䷉ 履虎尾，不咥人，亨。
        《象》曰：上天下澤，履，君子以辯上下，定民志。
        履原為鞋子的意思，引申則有履行，踐履的意思・再引申到道德上，意指行為所當踐履的，也就是禮。因此履也解釋作禮。馬王堆出士的帛書版的卦名則直接作「禮」。`,
  },
  1073: {
    top_hexagram: [
      ["亥 丑", "1", "(辛)", "", "1", "(癸)", "寅 子"],
      ["戌 子", "1", "", "戊 癸", "0", "", "卯 丑"],
      ["酉 亥", "0", "(癸)", "丁 壬", "0", "(己)", "辰  寅"],
      ["申 戌", "0", "(丁)", "丙 辛", "0", "(己)", "巳 卯"],
      ["未 酉", "1", "", "乙 庚", "0", "", "午 辰"],
      ["午 申", "1", "(辛)", "甲 己", "1", "(丁)", "未 巳"],
    ],
    top_hexagram_text: ["先天卦:兌卦䷹", "互卦:家人卦䷤"],
    bottom_hexagram: [
      ["巳 未", "0", "(丁)", "", "1", "(辛)", "申 午"],
      ["辰 午", "1", "", "戊 癸", "1", "", "酉 未"],
      ["卯 巳", "1", "(辛)", "丁 壬", "0", "(癸)", "戌 申"],
      ["寅 辰", "0", "(丁)", "丙 辛", "1", "(癸)", "亥 酉"],
      ["丑 卯", "1", "", "乙 庚", "0", "", "子 戌"],
      ["子 寅", "1", "(辛)", "甲 己", "1", "(丁)", "丑 亥"],
    ],
    bottom_hexagram_text: ["後天卦:中孚卦䷼", "互卦:頤卦䷚"],
    hexagram_description: `
        卦辭:䷹ 兌，亨，利貞。
        《象》曰：麗澤兌，君子以朋友講習。
        「兌」同「說」、「悅」，為喜悅的意思。兌卦與震卦，還有離、坎共為「四正卦」，離坎分主南北两方，而震兌分主東西。兌為西方之卦，於時節為秋季，秋天豐收為喜悅的季節。`,
  },
};

// update HTML with data
function updateHTML(searchText) {
  let hexagram1_content = `<div class="hexagrams mt-4">`;
  for (let i = 0; i < data[searchText].top_hexagram.length; i++) {
    hexagram1_content += `<div class="row hexagrams-row${i} mt-2">
        <!-- text -->
        <div class="fixed-hexagram-text">${data[searchText].top_hexagram[i][0]}</div>
        <!-- hexagram -->
        <div class=" hexagram" style="margin-left: 120px;">
        
        <img class="hexagram-img-left" src="static/images/hexagram-${data[searchText].top_hexagram[i][1]}.png" />
        
        </div>
        <!-- bracket text -->
        <div class="fixed-hexagram-bracket-text">${data[searchText].top_hexagram[i][2]}</div>
        
        <!-- text -->
        <div class="fixed-hexagram-text">${data[searchText].top_hexagram[i][3]}</div>
        <!-- hexagram -->
        <div class=" hexagram">
        <img class="hexagram-img-right" src="static/images/hexagram-${data[searchText].top_hexagram[i][4]}.png" />
        </div>

        <!-- bracket text -->
        <div class="fixed-hexagram-bracket-text">${data[searchText].top_hexagram[i][5]}</div>
        <!-- text -->
        <div class="fixed-hexagram-text" style="margin-left: 120px;">${data[searchText].top_hexagram[i][6]}</div>
    </div>`;
  }
  hexagram1_content += `</div>`;

  let hexagram1_text = `<div class="row">
    <div class="col hexagram-description-left">${data[searchText].bottom_hexagram_text[0]}</div>
    <div class="col hexagram-description-right">${data[searchText].bottom_hexagram_text[1]}</div>
    </div>`;

  const spacing = `<div class="space"></div>`;

  let hexagram2_content = `<div class="hexagrams mt-4">`;
  for (let i = 0; i < data[searchText].bottom_hexagram.length; i++) {
    hexagram2_content += `<div class="row hexagrams-row${i} mt-2">
            <!-- text -->
            <div class="fixed-hexagram-text">${data[searchText].bottom_hexagram[i][0]}</div>
            <!-- hexagram -->
            <div class=" hexagram" style="margin-left: 120px;">
            <img class="hexagram-img-left" src="static/images/hexagram-${data[searchText].bottom_hexagram[i][1]}.png" />
            </div>
            <!-- bracket text -->
            <div class="fixed-hexagram-bracket-text">${data[searchText].bottom_hexagram[i][2]}</div>
            <!-- text -->
            <div class="fixed-hexagram-text">${data[searchText].bottom_hexagram[i][3]}</div>
            <!-- hexagram -->
            <div class=" hexagram">
            <img class="hexagram-img-right" src="static/images/hexagram-${data[searchText].bottom_hexagram[i][4]}.png" />
            </div>
    
            <!-- bracket text -->
            <div class="fixed-hexagram-bracket-text">${data[searchText].bottom_hexagram[i][5]}</div>
            <!-- text -->
            <div class="fixed-hexagram-text" style="margin-left: 120px;">${data[searchText].bottom_hexagram[i][6]}</div>
        </div>`;
  }
  hexagram2_content += `</div>`;

  let hexagram2_text = `<div class="row">
    <div class="col hexagram-description-left">${data[searchText].top_hexagram_text[0]}</div>
    <div class="col hexagram-description-right">${data[searchText].top_hexagram_text[1]}</div>
    </div>`;

  let hexagram_description = `<div class="text-container">
    <p>
    ${data[searchText].hexagram_description.replace(/\n/g, "<br />")}
    </p>
    </div>`;

  contentToChange = document.getElementById("main");
  contentToChange.innerHTML =
    hexagram1_content +
    hexagram1_text +
    spacing +
    hexagram2_content +
    hexagram2_text +
    hexagram_description;
}
